cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Asian Lettuce Wraps
:PROPERTIES:
:export_file_name: asian-lettuce-wraps
:export_hugo_custom_front_matter: :servings 4
:export_hugo_custom_front_matter+: :prep-time 10
:export_hugo_custom_front_matter+: :cook-time 10
:export_hugo_custom_front_matter+: :ready-in 20
:export_hugo_custom_front_matter+: :source-url https://www.cookingclassy.com/lettuce-wraps/
:END:
*** Ingredients

- 3 tsp olive oil, divided
- 1 lb 93% lean ground turkey or chicken
- 4 - 5 Tbsp hoisin sauce to taste
- 1 Tbsp wheat free tamari
- 2 tsp sriracha (optional)
- 1 Tbsp rice vinegar
- 1 1/2 tsp sesame oil
- 1 tsp honey (optional)
- 1 Tbsp minced fresh garlic (3 cloves)
- 1 Tbsp peeled and minced fresh ginger
- 2/3 cup sliced green onions, white and light green portion, plus more green portion for serving
- 1 medium carrot, peeled and shredded (1/2 cup)
- 1 (8 oz) can water chestnuts, drained and chopped small
- 1 large head Bibb lettuce or iceberg lettuce

*** Directions

1. Heat 1 1/2 tsp oil in a 12-inch non-stick skillet over medium-high heat.
2. Add turkey or chicken in large crumbles then let cook until slightly browned on bottom, about 3 minutes, then break up and continue to cook until it's fully cooked through, about 3 minutes longer.
3. Meanwhile while turkey is cooking in a mixing bowl whisk together hoisin sauce, tamari, sriracha, rice vinegar, sesame oil and honey, set aside.
4. Drain of excess liquid from turkey (if there is any) then push to one far side of pan and pull that side of pan off heat.
5. Heat remaining 1 1/2 tsp oil in now empty side of skillet.
6. Add green onions and carrots and saute 1 1/2 minutes. Add in garlic and ginger and saute 30 seconds longer.
7. Pour in sauce and water chestnuts then cook and toss 30 seconds longer.
8. Serve warm in lettuce leaves garnished with sliced green onions.

